'''
Created on 2024

@author: aon24
'''

video_nv = '''
01.Коммуникативная компетентность консультанта
https://youtu.be/GKsOVaS6Qus?si=TsdSFsIa-cJALvnN
Сессия "Коммуникативная компетентность консультанта" открывает программу обучения на психолога-консультанта и рассматривает коммуникацию (или общение) - неотъемлемую часть нашей жизни и выстраивания отношений, а также основной инструмент в работе психолога с разных ракурсов.

02.Теория и практика психосинтеза
https://youtu.be/tLN4SkspH4s?si=tOeNdDHNZrX4qTel
Сессия "Психосинтез" предлагает изучать и практиковать различные методы, используемые в психозинтезе, в частности метод разотождествления и метод работы с субличностями (частями личности). На сессии слушатели много практикуют, работают с личным материалом, а также с предложенными кейсами.

03.Арт-терапия
https://youtu.be/P1f_bS48lOA?si=6eTxK6EPU1tvjiO0
Сессия "Арт-терапия" посвящена методу, который позволяет человеку найти собственный способ самовыражения, во многих случаях позволяет обходить "цензуру создания", предполагает атмосферу доверия и внимания к внутреннему миру человека. Этот метод практически не имеет противопоказаний и используется при работе со всем спектром клиентов, запросов, сложных жизненных ситуаций. На сессии, в ходе учебных консультаций, студентам будут предложены упражнения на прояснение запроса, на знакомство клиента с его чувствами и работа со сложными в переживании эмоциях с помощью методов арт-терапии (с тревогой, злостью, как пример), будут изучаться практические ресурсные техники.

04.Защитные механизмы психики
https://youtu.be/P7iDHzj-csU?si=jAEo-13kXSjFCEsz
Сессия "Защитные механизмы психики". Все направления психологии, психиатрия активно пользуются понятием защит. Поэтому разбираться в этих вопросах необходимо каждому специалисту, работающему с клиентами, для того чтобы провести диагностику клиента и выбрать верную терапевтическую стратегию работы с ним.

05.Особенности подросткового периода
https://youtu.be/HLg_Vtj5g3Y?si=03YxfchE1yfGbi6T
Сессия "Особенности подросткового периода" предоставляет участникам возможность работать с внутренней фигурой своего подростка, говорить о темах, которые актуальны для подросткового возраста и о том, как эти темы в дальнейшем разворачиваются во взрослой жизни. Стеденты практикуются с помощью визуализаций, техник краткосрочной позитивной терапии и ролевой игры.

06.Основы психологического консультирования
https://youtu.be/-aWhS5mGa2w?si=p09kUKhsIzc0Vmcl
Сессия "Основы психологического консультирования" Данную сессию особенно важно посещать лично, так как она подразумевает приобретение и отработку практических навыков. Будущие специалисты на практике смогут получить профессиональные ответы на вопросы: как выглядит психологическая консультация? из каких этапов она состоит? что такое клиентский запрос и как его сформулировать в рабочем варианте? Что такое этика и контакт? Как выглядят границы в терапевтическом взаимодействии?

07.Работа со сновидениями
https://youtu.be/zYhGCg-ZPA4?si=jMp6tegVp5HrRqCg
Сессия "Работа со сновидениями и образами" материал об особом языке нашего бессознательного, которым оно общается с нами. Студенты на сессии проходят практические упражнения, получают возможность овладеть практическими навыками по анализу образов бессознательного.

08.Психодрама, монодрама, ролевые игры
https://youtu.be/GRhN1bgHa8U?si=gXqFEbqmqcYLC0XU
Сессия "Психодрама, монодрама, ролевые игры" предлагает начинающим психологам консультантам возможность изучить и освоить на практике элементы психодраматических техник для индивидуальной работы с клиентом, такие как монолог, зеркало, обмен ролями, пустой стул, проигрывание роли и многие другие инструменты, позволяющие нам лучше понять себя.

09.Основы трансперсональной психологии
https://youtu.be/deTijWsYGYk?si=sd_6n41fY1sRFzYD
Сессия "Основы трансперсональной психологии" знакомит студентов с трехкомпонентной моделью Я, исследует контакт психики с базовым и высшим Я. Эта сессия про ответственность и принятие решений. На этой сессии студенты используют визуализации, техники из арт-терапия и участвуют в большом упражнение на выявление негативных установок и убеждений, изучают способы работы с ними.

10.Мифы и истории в консультировании
https://www.youtube.com/watch?v=usoYJ4-4j3A

11.Базовые архетипы психики
https://youtu.be/OePZwv-T5FE?si=Pp4P5d-hJTWlkaL-
Сессия "Базовые архетипы психики" предоставляет участникам возможность как на теоретическом, так и на практическом уровне познакомиться с понятием Архетипа и архетипической энергии, узнать как это явление оказывается влияние на жизнь человека и как мы, как психологи, можем на это повлиять.

12.Работа с эмоциями
https://youtu.be/c8CWbIQn2Is?si=gHJ7XdtsbVo-QNSN
Сессия "Работа с эмоциями" построена на двух психологических концепциях - терапия эмоциональных схем Роберта Лихи и Фокусированная на эмоциях терапия Лесли Гринберга. Одна из ключевых "техник", о которых пойдет речь на сессии - валидизация эмоций, позволяющая человеку почувствовать, что он имеет право на ту или иную эмоцию и что ни одна из переживаемых им эмоций не является ненужной, вредной, плохой или неправильной. Один из дней сессии представляет собой большое эксперинциальное упражнение, которое при готовности участников позволяет получить особенный опыт принятия и проживания непростых для них состояний. Это позволяет прикоснуться не только к уязвимым и потаённым уголкам собственной души, но и узнать что-то совершенно новое про своих коллег. Подобные процессы обычно приводят к сплочению группы, повышению степени ее общности и эмоциональной близости.

13.Психологические аспекты возникновения зависимостей и созависимостей
https://youtu.be/Ak0xYjJBtXc?si=CbJumkHA_BE-PUES
На сессии «Психологические аспекты возникновения зависимостей и созависимостей» рассматриваются различные виды зависимостей, причины их возникновения, а также созависимость как вид зависимого поведения. Студенты работают с вопросами личных границ, собственными чувствами и самооценкой, рассматриваются методы преодоления зависимостей.

14.Интерпретация и супервизия
https://youtu.be/3FfGDSi8XLQ?si=Lch8ySSyTDEjeU0t
Сессия "Интерпретация и супервизия в процессе консультирования" - предпоследняя в блоке психодинамического консультирования. Задача сессии - повторить и обобщить информацию о техниках консультирования в аналитическом подходе, а также более подробно поговорить об интерпретации: основной технике психолога-консультанта.

15.Логотерапия
https://youtu.be/ZDjEAAg37jU?si=V8lo8kfBhwmNtHYU
Сессия "Логотерапия" посвящена психотерапевтическому методу, суть которого заключается в оказании помощи клиенту в поиске и обретении им смысла собственной жизни. Иногда клиенты приходят к нам в состоянии, которое Виктор Франкл назвал экзистенциальным вакуумом. При видимом благополучии, субъективно человек чувствует себя глубоко несчастным, а свою жизнь считает лишённой смысла. На сессии мы научимся дифференцировать подобные состояния и работать с ними.

16.Аналитическая психология. Мать
https://youtu.be/LiG9pk2emMI?si=hCcYqGFycVbaOvSA
Сессия "Аналитическая психология. Мать". Мы будем говорить о таких аспектах как: влияние Матери на жизнь и формирование структур психики с точки зрения различных теорий - Д. Винникота, М. Кляйн, П. Критенден и других; рассмотрим типы материнской токсичности и ее отдаленные последствия; поговорим о мифах о материнстве, поработаем с личными историями и посмотрим на маму и ее жизнь, как на реального человека (а не только маму). После сессии меняются отношения с реальной мамой, с собой и с миром.

17.Когнитивно-поведенческая психотерапия
https://youtu.be/GRnCdR32j2A?si=nOved4Sq-K8bWTEn
Сессия "Основы Когнитивно-поведенческой терапии (КПТ)" предоставляет возможность на практике изучать техники, направленные на поиск когниций, влияющие на возникновение сложных эмоциональных переживаний и нежелательного поведения, техники, направленные на изменение дисфункциональных когниций. Живой контакт, очное участие в сессии и техниках позволяет начинающим специалистам лучше прочувствовать собеседника, видеть как собеседник располагает себя в пространстве, что даёт не мало информации для терапевта.

18.Краткосрочная позитивная психотерапия
https://youtu.be/V6T5hr8plSw?si=E8dQZdjer-2oNZVx
Сессия "Краткосрочная Позитивная Психотерапия" посвящена методу, с помощью которого психолог-консультант показывает клиенту реальную проблематику запроса, но в отличии от глубинной психотерапии, мы акцентируемся на здоровой части клиента. Показываем, что у него уже есть все для решения проблемы.

19.Возрастные кризисы
https://youtu.be/HrkUNkI83Sw?si=aFiVFMjxKoIEmYQh
Сессия "Возрастные психологические кризисы" о таком явлении, как "кризис" в целом, его важной роли в психике, этапах развития. Сессия наполнена практическими упражнениями, помогающими сопоставить личный опыт и теорию.

20.Аналитическая психология. Отец
https://youtu.be/2IPupaBGx4g?si=pbRdDV1me1BWryPD
Сессия "Аналитическая психология. Отец" позволяет лучше понять, какие задачи в психике ребенка помогает решить отец, знакомит с понятием отцовской функции, а также позволяет получить новый взгляд на отношения отцов и детей, как в целом, так и в личной истории. Сессия включает в себя теорию психодинамического подхода, практические упражнения и ролевую игру, которая позволяет "прикоснуться" к мужскому миру. Теоретические материалы и практические упражнения сессии затрагивают широкий спектр вопросов, касающихся отношений с отцом - реальным и внутренним.

21.Близость в отношениях
https://youtu.be/jxl9lyNOtfo?si=w4V9ULkQkysbrX4t
Сессия "Близость в отношениях" — единственная сессия в институте в которой два ведущих, так как близость это про двоих людей. На этой сессии будет много практики, благодаря которой Вы будете исследовать себя в контакте с партнером, будете исследовать свои чувства, мысли, ощущения, увидите ваши стратегии поведения в контакте с другим, получите опыт поддержки, принятия ... а также будете формировать собственное понимание близости.

22.Механизмы контрпереноса в консультировании
https://youtu.be/8eIIVGpo3Dg?si=wBcok-sl0Fcq8YR8
Сессия "Механизмы контрпереноса в консультировании" фокусируется на внутренних процессах консультанта в процессе работы, а также на контакте между консультантом и клиентом. Особое внимание уделяется работе со "сложными" клиентами, процесс консультирования которых сопряжен с повышенным уровнем напряжения для консультанта. В процессе этой сессии студенты обретают большее понимание глубинных процессов, протекающих между клиентом и консультантом, а также собственных особенностей и нюансов как консультантов

23.Символические ряды и системы
https://www.youtube.com/watch?v=ukZHSWA7-N4
Сессия "Символические ряды и системы" – продолжение темы работы с символикой, практические занятие работы с ассоциативными, метафорическими картами.

24.Отношения и деньги
https://youtu.be/PzguOlvi11w?si=yvfkuIZYCPyWv3xj
Сессия "Отношения и деньги" предоставляет будущим психологам-консультантам возможность найти для себя техники и инструменты для работы с такими клиентскими запросами: "Как начать зарабатывать больше?" "Не умею обращаться с деньгами, финансами." "Как научиться копить?" "Хочу избавиться от шопоголизма." Или наоборот: "только складываю", "не умею тратить на себя", "не умею получать удовольствие от покупок" и с прочие запросами, связанными с финансами. Студенты на сессии выполняют консультационные упражнения, связанные с работой с установками и убеждениями, с проективным материалом, выполняют упражнения из процессуальной психологии.

25.Проекция и проективные методы в психологии
https://youtu.be/dfmWYzWHQpg?si=RDB7gX_CR6HA-M3t
Сессия "Проекции и проективные методы" – о работе с образами и метафорами, включает в себя многообразие практических занятий, позволяет получить важные профессиональные навыки психолога консультанта.

26.Этика. Терапевтические отношения
https://youtu.be/zl4lIg9xvho?si=6nFWN_aKXWUQN8MA
Сессия "Этика. Терапевтические отношения" предназначена для исследования следующих практических вопросов: что для меня значит моя работа, какой я консультант, как я помогаю своим клиентам, как бессознательно использую клиентов в своих интересах.

27.Особенности работы с травмой
https://youtu.be/NiBB8OJrAp4?si=KApukc58WwuORc5L
Сессия "Особенности работы с травмой" посвящена особенности работы как с единичными шоковыми травмами, в том числе при ПТСР, так и с множественными травмами. Студенты изучают вопросы нейрофизиологии головного мозга и то, что происходит с человеком в момент ситуации, угрожающей жизни; какие есть этапы работы с травмой и особенности работы на каждом этапе . Также рассмотриваются травматические расколы при множественных угрожающих ситуациях и стратегию работы психолога консультанта в этом случае.

28.Схема терапия
https://www.youtube.com/watch?v=6d7w4-66qMw
Сессия "Схема терапия " позволяет не только познакомиться с теорией по схема терапии, но и поииследовать собственные схемы и режимы. Даёт возможность каждому участнику задуматься о том, как он может укрепить режим своего Здорового Взрослого и Счастливого Ребенка, что не только способствует повышению уровня профессионализма , но и помогает в личной жизни.

29. Теория привязанности
https://youtu.be/kjRvMVz_bdM?si=fPX5rbXswRGk_03T
Теория привязанности соединяет в себе объяснительные принципы различных концепций - психоанализа, теории научения и когнитивного развития, теории ментализации, этологический подход. Теория привязанности научно обоснована нейробиологическими исследованиями и включает в себя факторы биологического развития человека. Центральное место в теории привязанности занимают ранние отношения ребёнка с близким взрослым. Именно это опыт в первые года жизни порождает привязанность ребёнка к значимому взрослому, что во многом определяет дальнейший ход психического и личностного развития человека. Теория привязанности даёт объяснение почему возникают и изменяются сильные эмоциональные связи между людьми любых возрастов. На сессии студенты участвуют в упражнениях, позволяющих проживать в безопасной обстановке опыт собственных бессознательных стратегий привязанности. Получают профессиональный опыт консультирования основанный на привязанности. Особую ценность этому опыту даёт живое взаимодействие участников группы.

30.Работа с утратой
https://youtu.be/I5NpTehuEBo?si=95m65tv7qc-SC1Hp
Утрата это неотъемлемая часть жизни, одно из самых тяжелых переживаний. В профессиональной деятельности любого психолога-консультанта высоковероятна встреча с таким личным материалом клиента, неизбежна встреча и с собственными личными переживаниями утраты, потерь. В ходе сессии разбираются особенности реагирования на утрату через призму теории привязанностей. Студенты получают представление о различных стратегиях работы с переживанием утраты, в ходе упражнений изучаются первоначальные навыки работы по этим стратегиям. Учебная группа предоставляет большее разнообразие психического материала и реакций для исследования будущими психологами-консультантами. При этом, групповой процесс смягчает реакции, бережно сопровождая каждого участника. Сессия поможет лучше узнать свои особенности реагирования и обеспечить понимание происходящих процессов в помощь себе и клиентам.

31. Механизму контрпереноса в консультировании
https://youtu.be/8eIIVGpo3Dg?si=ECD4SUVpCFB9zFTU
Сессия "Механизмы контрпереноса в консультировании" фокусируется на внутренних процессах консультанта в процессе работы, а также на контакте между консультантом и клиентом. Особое внимание уделяется работе со "сложными" клиентами, процесс консультирования которых сопряжен с повышенным уровнем напряжения для консультанта. В процессе этой сессии студенты обретают большее понимание глубинных процессов, протекающих между клиентом и консультантом, а также собственных особенностей и нюансов как консультантов

32.Циклы лекций
'''.split('\n\n')


def loadYoutube(t):
    val = ''

    if 'Логотерапия' in t:
        val = '''https://www.youtube.com/watch?v=ZDjEAAg37jU
# Сессия "Логотерапия", институт психологического консультирования "Новый век"
# Сессия "Логотерапия" посвящена психотерапевтическому методу, суть которого заключается в оказании помощи клиенту в поиске и обретении им смысла собственной жизни.  Иногда клиенты приходят к нам в состоянии, которое Виктор Франкл назвал экзистенциальным вакуумом. При видимом благополучии, субъективно человек чувствует себя глубоко несчастным, а свою жизнь считает лишённой смысла. На сессии мы научимся дифференцировать подобные состояния и работать с ними.
# Учебная программа института "Новый Век" позволяет получить диплом о профессиональной подготовке специалиста (второе высшее образование) по специальности "Психолог консультант"
# https://institutnv.ru/professionalnaya-perepodgotovka/
# Преподаватели этого учебного курса - практикующие специалисты. Это позволяет студентам получить не только теоретическую подготовку, но и отработать практические навыки в индивидуальных, парных и групповых упражнениях https://institutnv.ru/sotrudniki/
# Практикующие специалисты получают возможность участвовать в тематических тренингах, семинарах, конференциях, организуемых признанными мастерами профессии
# https://institutnv.ru/seminary-i-treningi/
'''
        val = '''https://www.youtube.com/watch?v=ZDjEAAg37jU
# Логотерапия
# Сессия "Логотерапия" посвящена психотерапевтическому методу, суть которого заключается в оказании помощи клиенту в поиске и обретении им смысла собственной жизни.  Иногда клиенты приходят к нам в состоянии, которое Виктор Франкл назвал экзистенциальным вакуумом. При видимом благополучии, субъективно человек чувствует себя глубоко несчастным, а свою жизнь считает лишённой смысла. На сессии мы научимся дифференцировать подобные состояния и работать с ними.

'''

    elif 'Мифы и истории в консультировании' in t:  # нет в канале
        val = '''https://www.youtube.com/watch?v=usoYJ4-4j3A
# Мифы
# Мифы и истории в консультировании
#
'''

    elif 'Символические' in t:
        val = '''https://www.youtube.com/watch?v=ukZHSWA7-N4
# Символические ряды и системы
# Сессия "Символические ряды и системы" – продолжение темы работы с символикой, практические занятие работы с ассоциативными, метафорическими картами.
'''

    elif 'Схема' in t:
        val = '''https://www.youtube.com/watch?v=6d7w4-66qMw
# Схема терапия
# Сессия "Схема терапия " позволяет не только познакомиться с теорией по схема терапии, но и поииследовать собственные схемы и режимы. Даёт возможность каждому участнику задуматься о том, как он может укрепить режим своего Здорового Взрослого и Счастливого Ребенка, что не только способствует повышению уровня профессионализма , но и помогает в личной жизни.
'''
    return val

